Table of Contents
 Class LoadingULS
Namespace
IdeaRS.OpenModel.Concrete.Load
Assembly
IdeaRS.OpenModel.dll
Loading ULS
public class LoadingULS
Inheritance
object
LoadingULS
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 LoadingULS()
Constructor
public LoadingULS()
Properties
 InternalForces
Internal force in section (permanent for staged section)
public ResultOfInternalForces InternalForces { get; set; }
Property Value
ResultOfInternalForces
 InternalForces2ndOrder
Internal forces of 2nd order effect
public ResultOfInternalForces InternalForces2ndOrder { get; set; }
Property Value
ResultOfInternalForces
 InternalForcesBegin
Internal forces at the beginnig
public ResultOfInternalForces InternalForcesBegin { get; set; }
Property Value
ResultOfInternalForces
 InternalForcesEnd
Internal forces at the end
public ResultOfInternalForces InternalForcesEnd { get; set; }
Property Value
ResultOfInternalForces
 InternalForcesImperfection
Internal forces of imperfection effect
public ResultOfInternalForces InternalForcesImperfection { get; set; }
Property Value
ResultOfInternalForces
 InternalForcesVariable
Variable internal force in staged section only
public ResultOfInternalForces InternalForcesVariable { get; set; }
Property Value
ResultOfInternalForces
 Edit this page